let चरसंख्या;
let पदसंख्या;
let चरसरणी = [];
let द्विमीयपदम् = [[]];
let धारितपदम्;
let पदम् = [];
let द्विमीयसमीकरणम् = "";
let फलद्विमीयसमीकरणम् = [[]];
const label = document.getElementById("number-display");
//Math.floor(Math.random() * (max - min + 1)) + min
document.getElementById("roll-btn").addEventListener("click", function() {
    द्विमीयपदम् = [];
    //चरसंख्या = 3;
    //पदसंख्या = 2;
    चरसंख्या = Math.floor(Math.random() * 3) + 4;
    if (चरसंख्या == 3){
        चरसरणी = ['A','B','C'];
    } else if (चरसंख्या == 4){
        चरसरणी = ['A','B','C','D'];
    } else if (चरसंख्या == 5){
        चरसरणी = ['A','B','C','D','E'];
    } else if (चरसंख्या == 6){
        चरसरणी = ['A','B','C','D','E','F'];
    }
    पदसंख्या = Math.floor(Math.random() * 6) + 4;
    for (र=0; र<पदसंख्या; र++) {
        पदम् = [];
        let अज्ञात = 0;
        for (स=0; स<चरसंख्या; स++) {
            if (चरसंख्या < 3 ) {
                धारितपदम् = Math.floor(Math.random()*2);
            } else {
                धारितपदम् = Math.floor(Math.random()*3);
            }
            if (धारितपदम् == 2) {
                if (चरसंख्या - अज्ञात > 2 ) {
                    अज्ञात++;
                } else {
                    धारितपदम् = Math.floor(Math.random()*2);
                }
            } 
            पदम्.push(धारितपदम्);
        }
        द्विमीयपदम्.push(पदम्);
    }

    द्विमीयपदम् = पुनरावृत्तिनिवारणम्(द्विमीयपदम्);
    द्विमीयसमीकरणम् = नामरूपान्तरणम्(द्विमीयपदम्);
    पूर्णद्विमीयसमीकरणम् = पूर्णद्विमीयनिर्माणम् (द्विमीयपदम्);
    लघुतमपदानि = लघुतमपदानिनिर्माणम् (पूर्णद्विमीयसमीकरणम्);
    let फलसूची = एकपरिवर्तनपरीक्षणम् (पूर्णद्विमीयसमीकरणम्);
    फलद्विमीयसमीकरणम् =  पूर्णफलसमीकरणनिर्माणम् (फलसूची, लघुतमपदानि);
    //console.table(फलद्विमीयसमीकरणम्);
    label.innerText = द्विमीयसमीकरणम्;
});

function नामरूपान्तरणम् (द्विमीयपदम्) {
    द्विमीयसमीकरणम् = "";
    for (र=0; र<द्विमीयपदम्.length; र++) {
        for (स=0; स<द्विमीयपदम्[र].length; स++) {
            if (द्विमीयपदम्[र][स] == 0) {
                अस्थायी=चरसरणी[स];
                अस्थायी = अस्थायी+"'";

            } else if (द्विमीयपदम्[र][स] == 1) {
                अस्थायी=चरसरणी[स];
            } else if (द्विमीयपदम्[र][स] == 2) {
                अस्थायी="";
            } else {
                throw new Error("Error in generating equation");
            }
            द्विमीयसमीकरणम् = द्विमीयसमीकरणम्+अस्थायी;
        }
        if (र!=द्विमीयपदम्.length-1){
            द्विमीयसमीकरणम् = द्विमीयसमीकरणम्+"+";
        }
        
    }
    return द्विमीयसमीकरणम्;
}
function पुनरावृत्तिनिवारणम् (द्विमीयपदम्) {
    for (र=0; र<द्विमीयपदम्.length; र++) {
        प = द्विमीयपदम्[र].join("");
        for (स=र+1; स<द्विमीयपदम्.length; स++) {
            द = द्विमीयपदम्[स].join("");
            if (द == प) {
                द्विमीयपदम्.splice(स, 1);
                स--;
            }

        }
    }
    return द्विमीयपदम्;
}


function पूर्णएकायामनिर्माणम् (द्विमीयपदम्) {
   let प्राप्तसाम्यम् = 0;
   let द्विरुक्तद्विमीयपदम् = [[],[]];
    for (let र=0; र<द्विमीयपदम्.length; र++) {
        if (द्विमीयपदम्[र] == 2) {
            प्राप्तसाम्यम् = 1;
            break;
        }
    }
    if (प्राप्तसाम्यम् == 0) {
        return द्विमीयपदम्;
    } else {
        द्विरुक्तद्विमीयपदम्[0] = [];
        द्विरुक्तद्विमीयपदम्[1] = [];
        for (let र=0; र<द्विमीयपदम्.length; र++) {
            द्विरुक्तद्विमीयपदम्[0][र] = द्विमीयपदम्[र];
            द्विरुक्तद्विमीयपदम्[1][र] = द्विमीयपदम्[र];
        }
        return पूर्णद्विमीयनिर्माणम् (द्विरुक्तद्विमीयपदम्);
    }
}
    

function पूर्णद्विमीयनिर्माणम् (द्विमीयपदम्) {
   let द्विरुक्तद्विमीयपदम् = [[]];
    for (let र=0; र<द्विमीयपदम्.length; र++) {
        द्विरुक्तद्विमीयपदम्[र] = [];
        for (let स=0; स< द्विमीयपदम्[र].length; स++) {
            द्विरुक्तद्विमीयपदम्[र][स] = द्विमीयपदम्[र][स];
        }
    }
    for (let र=0; र<द्विरुक्तद्विमीयपदम्.length; र++) {
        for (let स=0; स< द्विरुक्तद्विमीयपदम्[र].length; स++) {
            
            if (द्विरुक्तद्विमीयपदम्[र][स] == 2) {
                let अस्थायीद्विमीयपदम्_1 = [];
                let अस्थायीद्विमीयपदम्_2 = [];
                for (let प=0; प<द्विरुक्तद्विमीयपदम्[र].length; प++) {
                    अस्थायीद्विमीयपदम्_1[प] = द्विरुक्तद्विमीयपदम्[र][प];
                    अस्थायीद्विमीयपदम्_2[प] = द्विरुक्तद्विमीयपदम्[र][प];
                }
                अस्थायीद्विमीयपदम्_1[स] = 1;
                द्विरुक्तद्विमीयपदम्.push(अस्थायीद्विमीयपदम्_1);
                अस्थायीद्विमीयपदम्_2[स] = 0;
                द्विरुक्तद्विमीयपदम्.push(अस्थायीद्विमीयपदम्_2);
                break;
            }
        }
    }
    for (let र=0; र<द्विरुक्तद्विमीयपदम्.length; र++) {
        for (let स=0; स<द्विरुक्तद्विमीयपदम्[र].length; स++) {
            if (द्विरुक्तद्विमीयपदम्[र][स] == 2) {
                द्विरुक्तद्विमीयपदम्.splice(र, 1);
                र--;
                break;
            }
        }
    }
    for (let र=0; र<द्विरुक्तद्विमीयपदम्.length; र++) {
        let प = द्विरुक्तद्विमीयपदम्[र].join("");
        for (let स=र+1; स<द्विरुक्तद्विमीयपदम्.length; स++) {
            let द = द्विरुक्तद्विमीयपदम्[स].join("");
            if (द == प) {
                द्विरुक्तद्विमीयपदम्.splice(स, 1);
                स--;
            }
        }
    }
    return द्विरुक्तद्विमीयपदम्;
}
function लघुतमपदानिनिर्माणम् (पूर्णद्विमीयसमीकरणम्) {
    लघुतमपदानि = [];
    for (र=0; र<पूर्णद्विमीयसमीकरणम्.length; र++) {
        लघुतमपदानि.push(parseInt(पूर्णद्विमीयसमीकरणम्[र].join(""),2));
    }
    return लघुतमपदानि;
}

function एकपरिवर्तनपरीक्षणम् (द्विमीयपदम्) {
    let भेदसूची = [];
    let द्विरुक्तद्विमीयपदम् = [];
    //console.table(द्विमीयपदम्);
    let प्राप्तसाम्यम् = 1;
    let भेदः = 0;
    let भेदस्थानम् = 0;
    for (let र=0; र<द्विमीयपदम्.length; र++) {
        द्विरुक्तद्विमीयपदम्[र] = [];
        for (let स=0; स< द्विमीयपदम्[र].length; स++) {
            द्विरुक्तद्विमीयपदम्[र][स] = द्विमीयपदम्[र][स];
        }
    }
    while (प्राप्तसाम्यम् ==1) {
        let अस्थायीद्विमीयपदम् = [];
        भेदसूची = [];
        for (let र=0; र<द्विरुक्तद्विमीयपदम्.length; र++) {
            for (let स=र+1; स<द्विरुक्तद्विमीयपदम्.length; स++) {
                भेदः = 0;
                let अस्थायीपदम् = [];
                for (let प=0; प < द्विरुक्तद्विमीयपदम्[र].length; प++) {
                    अस्थायीपदम्[प] = द्विरुक्तद्विमीयपदम्[र][प];
                    if (द्विरुक्तद्विमीयपदम्[र][प] !==  द्विरुक्तद्विमीयपदम्[स][प]) {
                        भेदः++;
                        भेदस्थानम् = प;
                        if (भेदः > 1) {
                            break;
                        }
                    }
                }
                if (भेदः == 1) {
                    भेदसूची.push(र);
                    भेदसूची.push(स);
                    अस्थायीपदम्[भेदस्थानम्] = 2;
                    अस्थायीद्विमीयपदम्.push([...अस्थायीपदम्]);
                }
            }
        }
        if (भेदसूची.length ==0) {
            प्राप्तसाम्यम् =0;
        } else {
            प्राप्तसाम्यम् =1;
        }
        भेदसूची.sort((प , द) => द - प);
        for (let र=0; र<भेदसूची.length; र++) {
            द्विरुक्तद्विमीयपदम्.splice(भेदसूची[र],1);
        }
        द्विरुक्तद्विमीयपदम्.push(...अस्थायीद्विमीयपदम्);
        अस्थायीद्विमीयपदम्=[];
        for (let र=0; र<द्विरुक्तद्विमीयपदम्.length; र++) {
            let प = द्विरुक्तद्विमीयपदम्[र].join("");
            for (let स=र+1; स<द्विरुक्तद्विमीयपदम्.length; स++) {
                let द = द्विरुक्तद्विमीयपदम्[स].join("");
                if (द == प) {
                    द्विरुक्तद्विमीयपदम्.splice(स, 1);
                    स--;
                }

            }
        }
    }
    return द्विरुक्तद्विमीयपदम्;
}

function पूर्णफलसमीकरणनिर्माणम् (द्विमीयपदम्, लघुतमपदानि) {
    let एकफलपूर्णसमीकरणम् = []; 
    let प्राप्तसाम्यम् =0;
    let द्विमीयफलम् = [];
    let अस्थायीएकफलपूर्णसमीकरणम् = [];
    let द्विरुक्तलघुतमपदानि = [...लघुतमपदानि];
    let द्विरुक्तद्विमीयपदम् = [...द्विमीयपदम्];
    //console.table(द्विरुक्तद्विमीयपदम्);
    //console.log(द्विरुक्तलघुतमपदानि);
    let द्विमीयएकफलपूर्णसमीकरणम् = [];
    for (let र=0; र<द्विरुक्तद्विमीयपदम्.length; र++) {
        अस्थायीएकफलपूर्णसमीकरणम् = पूर्णएकायामनिर्माणम् (द्विरुक्तद्विमीयपदम्[र]);
        द्विमीयएकफलपूर्णसमीकरणम्[र] = [];
        एकफलपूर्णसमीकरणम्[र]=0;
        if (Array.isArray(अस्थायीएकफलपूर्णसमीकरणम्[0])) {
            for (let स=0; स<अस्थायीएकफलपूर्णसमीकरणम्.length; स++) {
                for (let म=0; म < लघुतमपदानि.length; म++) {
                    if (parseInt(अस्थायीएकफलपूर्णसमीकरणम्[स].join(""),2)  == लघुतमपदानि[म]) {
                        द्विमीयएकफलपूर्णसमीकरणम्[र].push(parseInt(अस्थायीएकफलपूर्णसमीकरणम्[स].join(""),2));
                        एकफलपूर्णसमीकरणम्[र]++;
                    }
                }
            }
        } else {
            if (Array.isArray(लघुतमपदानि)) {
                for (let म=0; म < लघुतमपदानि.length; म++) {
                    if (parseInt(अस्थायीएकफलपूर्णसमीकरणम्.join(""),2)  == लघुतमपदानि[म]) {
                        द्विमीयएकफलपूर्णसमीकरणम्[र].push(parseInt(अस्थायीएकफलपूर्णसमीकरणम्.join(""),2));
                        एकफलपूर्णसमीकरणम्[र]++;
                    }
                }
            } else {
                if (parseInt(अस्थायीएकफलपूर्णसमीकरणम्.join(""),2)  == लघुतमपदानि) {
                    द्विमीयएकफलपूर्णसमीकरणम्[र].push(parseInt(अस्थायीएकफलपूर्णसमीकरणम्.join(""),2));
                    एकफलपूर्णसमीकरणम्[र]++;
                }
                            
            }

        }
    }
    //console.table (द्विमीयएकफलपूर्णसमीकरणम्);
    //console.log(एकफलपूर्णसमीकरणम्);
        //parseInt(पूर्णद्विमीयसमीकरणम्[र].join(""),2)
        //for (let द =0; द < एकफलपूर्णसमी
        // करणम्[र].length; द++) {
        //    for (let म=0; म < लघुतमपदानि.length; म++) {
        //        if (एकफलपूर्णसमीकरणम्[द] == लघुतमपदानि[म]) {
        //            प्राप्तसाम्यम् =1;
        //            break;
        //        }
        //    }
        //    if (प्राप्तसाम्यम् ==0) {
        //        एकफलपूर्णसमीकरणम्.splice(द,1);
        //        द--;
        //    }
        //}
        //द्विमीयएकफलपूर्णसमीकरणम्.push(एकफलपूर्णसमीकरणम्);
    
    ////console.table(एकफलपूर्णसमीकरणम्);
    
    while (द्विरुक्तलघुतमपदानि.length >0 ) {
        let अत्यधिकदीर्घता = 0;
        let अतिविशालः = -1;
        for (let र=0; र<एकफलपूर्णसमीकरणम्.length; र++) {
            if (एकफलपूर्णसमीकरणम्[र] > अत्यधिकदीर्घता) {
                अत्यधिकदीर्घता = एकफलपूर्णसमीकरणम्[र];
                अतिविशालः = र;

            }
        }
        if (अतिविशालः == -1 || अत्यधिकदीर्घता == 0) break;
        
        for (let स=0; स<द्विमीयएकफलपूर्णसमीकरणम्[अतिविशालः]; स++) {
            for (let द =0; द < द्विरुक्तलघुतमपदानि.length; द++) {
                if (द्विरुक्तलघुतमपदानि[द] == द्विमीयएकफलपूर्णसमीकरणम्[अतिविशालः][स]) {
                    द्विरुक्तलघुतमपदानि.splice(द,1);
                    द--;
                }
            }
        }
        if (Array.isArray(द्विमीयएकफलपूर्णसमीकरणम्[अतिविशालः])) { 
            for (let स=0; स<द्विमीयएकफलपूर्णसमीकरणम्[अतिविशालः].length; स++) {
                for (let र=0; र<द्विमीयएकफलपूर्णसमीकरणम्.length; र++) {
                    for (let द =0; द < द्विमीयएकफलपूर्णसमीकरणम्[र].length && र != अतिविशालः; द++) {
                        if (द्विमीयएकफलपूर्णसमीकरणम्[र][द] == द्विमीयएकफलपूर्णसमीकरणम्[अतिविशालः][स]) {
                            द्विमीयएकफलपूर्णसमीकरणम्[र].splice(द,1);
                            द--;
                            break;
                        }
                    }
                }
            } 
        } else {
            if (अतिविशालः != 0) {
                //console.log(अतिविशालः);
                throw new Error ("अतिविशालः");
            } else {
                द्विमीयफलम्.push(द्विरुक्तद्विमीयपदम्[अतिविशालः]);
                break;
            }
        }
        //console.table (द्विमीयएकफलपूर्णसमीकरणम्);
        //console.log(एकफलपूर्णसमीकरणम्);
        एकफलपूर्णसमीकरणम्[अतिविशालः] = 0;
        द्विमीयफलम्.push(द्विरुक्तद्विमीयपदम्[अतिविशालः]);
        द्विरुक्तद्विमीयपदम्.splice(अतिविशालः,1);
        एकफलपूर्णसमीकरणम्.splice(अतिविशालः,1);
        द्विमीयएकफलपूर्णसमीकरणम्.splice(अतिविशालः,1);

    }
    //console.table(द्विमीयफलम्);
    return द्विमीयफलम्;

}

document.getElementById("check-btn").addEventListener("click", function() {
    const label1 = document.getElementById("result_validation");
    let उपयोक्तृकृतफलसूची = document.getElementById("minterm-input").value.toUpperCase();;
    let उपयोक्तृफलसमीकरणम् = [[]];
    if (द्विमीयसमीकरणम् == "") {
        label1.innerText = " Generate Equation first";
        return;
    }
    let फलसूची_1 = उपयोक्तृकृतफलसूची.replace(/&/g, '');
    let फलसूची_2 = फलसूची_1.replace(/ /g, '');
    let फलसूची_3 = फलसूची_2.split('+');
    let उपयोक्तृफलद्विमीयसमीकरणम् = [];
    for (let स=0; स < फलसूची_3.length; स++) {
        उपयोक्तृफलद्विमीयसमीकरणम्.push(फलसूची_3[स].split(''));
    }
    if (उपयोक्तृफलद्विमीयसमीकरणम्.length != फलद्विमीयसमीकरणम्.length) {
        label1.innerText = " Wrong number of min terms";
        return;
    }

    
    for (let स=0; स < उपयोक्तृफलद्विमीयसमीकरणम्.length; स++) {
        उपयोक्तृफलसमीकरणम्[स] = new Array(चरसरणी.length).fill(2);
        for (let र=0; र<उपयोक्तृफलद्विमीयसमीकरणम्[स].length; र++) {
            let प्राप्तसाम्यम् = 0;
            for (let प=0; प < चरसरणी.length; प++) {
                if (उपयोक्तृफलद्विमीयसमीकरणम्[स][र] == चरसरणी[प]) {
                    प्राप्तसाम्यम्=1;
                    if (उपयोक्तृफलद्विमीयसमीकरणम्[स][र+1] == "'") {
                        र++;
                        उपयोक्तृफलसमीकरणम्[स][प] = 0;
                        
                    } else {
                        उपयोक्तृफलसमीकरणम्[स][प] = 1;
                        
                    }
                    break;
                }
            }
            if (प्राप्तसाम्यम् == 0) {
                label1.innerText = " Wrong characters in output";
                return;
            }
        }
    }
    for (let स=0; स < उपयोक्तृफलसमीकरणम्.length; स++) {
        let उपयोक्तृफलम् = उपयोक्तृफलसमीकरणम्[स].join('');
        let प्राप्तसाम्यम् = 0;
        for (let र=0; र<फलद्विमीयसमीकरणम्.length; र++) {
            let फलम् = फलद्विमीयसमीकरणम्[र].join('');
            if (फलम् == उपयोक्तृफलम्) {
                प्राप्तसाम्यम्=1;
                break;
            }
        }
        if (प्राप्तसाम्यम् == 0) {
            label1.innerText = " Wrong answer";
            return;
        }

    }
    label1.innerText = "Correct answer";
});
